/*---------------------------------------------------------*/
/************************************************************
飞翔科技MC9S12XEP100汽车电子综合开发平台 
E-mail: 2008f.d@163.com
淘宝店：http://fxfreefly.taobao.com
************************************************************/
/*---------------------------------------------------------*/
#include <hidef.h>      /* common defines and macros */
#include "derivative.h"      /* derivative-specific definitions */

#define LEDCPU PORTK_PK4
#define LEDCPU_dir DDRK_DDRK4

/*************************************************************/
/*                        初始化看门狗                       */
/*************************************************************/
void INIT_COP(void)
{
  COPCTL = 0x07;     //设置看门狗复位间隔为1.048576s
}

/*************************************************************/
/*                         延时函数                          */
/*************************************************************/
void delay(void)
{
  unsigned int i;
  for(i=0;i<50000;i++);
}


/*************************************************************/
/*                         主函数                            */
/*************************************************************/
void main(void) {
  DisableInterrupts;
  INIT_COP();
  LEDCPU_dir = 1;
  LEDCPU = 0;
  delay();
  LEDCPU = 1;
  EnableInterrupts;

  for(;;) 
  {
    _FEED_COP();  //喂狗函数
    delay();
  } 
}
